/**
 * =============================================================================
 * НАЗВАНИЕ ЗАДАЧИ: 1. Two Sum (LeetCode)
 * СЛОЖНОСТЬ: Easy
 * * * УСЛОВИЕ:
 * Дан массив целых чисел `nums` и целое число `target`. Верните индексы двух 
 * чисел так, чтобы в сумме они давали `target`.
 * * * Можно предположить, что каждый входной массив имеет ровно одно решение, 
 * и нельзя использовать один и тот же элемент дважды.
 * * * Вы можете вернуть ответ в любом порядке.
 * * * Пример:
 * Input: nums = [2,7,11,15], target = 9
 * Output: [0,1]
 * Explanation: nums[0] + nums[1] == 9, поэтому возвращаем [0, 1].
 * =============================================================================
 */

/**
 * @param {number[]} nums
 * @param {number} target
 * @return {number[]}
 */
var twoSum = function(arr, target) {
    for (let i = 0; i < arr.length; i++) {
        for (let j = i + 1; j < arr.length; j++) {
            if (arr[i] + arr[j] === target) {
                return [i, j];
            }
        }
    }
};